<?php

return [
    'adminEmail' => 'no-reply@primekraft.ru',
    'saleEmail' => 'sale@primekraft.ru',
    'admins' => ['l.chevardin@storverk.com', 'a.barzukov@storverk.com'],
    'partner-managers' => ['p.cherlov@primekraft.ru'],

    "postalSettings" => [
        "zipCodeFrom" => "194044",
        "defaultPrice" => "450",
        "packagingWeight" => "100"
    ],

    "deliveryCourier" => [
        "packagingWeight" => "100",
        "tariff" => [
            "Санкт-Петербург" => [
                [0, 1000, 200],
                [1000, 3000, 230],
                [3000, 5000, 250],
                [5000, 7000, 270],
                [7000, 10000, 310],
                [10000, 20000, 350],
                [20000, 30000, 450],
            ],
            "Москва" => [
                [0, 1000, 260],
                [1000, 3000, 290],
                [3000, 5000, 350],
                [5000, 7000, 370],
                [7000, 10000, 390],
                [10000, 20000, 450],
                [20000, 30000, 600],
            ]
        ]
    ],

    "delivery" => [
        "free" => [
            "capital" => 2500,
            "regions" => 5500
        ]
    ],

    'invoice' => [
        // время через которое счет считается просроченным, если = 0 - бессрочно
        'expires' => 0
    ],

    "robokassa" => [
        "sMerchantLogin" => "primekraft",
        //test
        /*
        "sMerchantPass1" => "Jits94K0iWPOu5WTWK1d",
        "sMerchantPass2" => "sXTiOgU61slrY9i2NyJ3",
        */
        //prod
        "sMerchantPass1" => "nF0D24zSoyZjgxfQJ94v",
        "sMerchantPass2" => "uv0mvpd6SLNO27WIR4oF"
    ],

    // срок жизни cookies с промо-кодом по-умолчанию в днях
    'defaultReferralCodeCookieExpire' => 14,

    'partnerChargePercent_lvl1' => 15,
    'partnerChargePercent_lvl2' => 5,

    'user' => [
        // срок действия токена восстановления пароля в днях (0 - бессрочно)
        'restore_token_expire' => 3,
        'defaultRegisterPromocode' => 'ADMIN'
    ],


    //% отчислений партнеру. Считается от суммы скидки
  //  'discountChargePercent' => 200,
    // Минимальная сумма вывода денег для партнера
    'discountMinPayout' => 3000,

    // Шаблон скидок для партнеров
    // Ключ-id товара, значение - проценты скидки
    'discounts' => [
        "4" => "10",
        "7" => "10",
        "8" => "10",
        "9" => "10",
        "10" => "10",
        "11" => "10",
        "12" => "10",
        "13" => "10",
        "14" => "10",
        "15" => "10",
        "16" => "10",
        "17" => "10",
        "18" => "10",
        "19" => "10",
        "20" => "10",
        "21" => "10",
        "22" => "10",
        "23" => "10",
        "24" => "10",
        "25" => "10",
        "26" => "10",
        "27" => "10",
        "28" => "10",
        "29" => "10",
        "30" => "10",
        "31" => "10",
        "32" => "10",
        "33" => "10",
        "34" => "10",
        "35" => "10",
        "36" => "10",
        "37" => "10",
        "38" => "10",
        "39" => "10",
        "40" => "10",
        "41" => "10",
        "42" => "10",
        "43" => "10",
        "44" => "10",
        "45" => "10",
        "46" => "10",
        "47" => "10",
        "48" => "10",
        "49" => "10",
        "50" => "10",
        "51" => "10",
        "52" => "10",
        "53" => "10",
        "54" => "10",
        "55" => "10",
        "56" => "10",
        "57" => "10",
        "58" => "10",
        "59" => "10",
        "60" => "10",
        "61" => "10",
        "62" => "10",
        "63" => "10",
        "64" => "10",
    ]
];
